Dlubal.RFEM5.IAverageRegions
Interface for working with average regions.

Dlubal.RFEM5.IAverageRegions.PrepareModification
Prepares application for data modification.

Dlubal.RFEM5.IAverageRegions.FinishModification
Finishes data modification and updates the model.

Dlubal.RFEM5.IAverageRegions.CancelModification
Cancels current data modification.

Dlubal.RFEM5.IAverageRegions.Clean
Cleans average regions objects.

Dlubal.RFEM5.IAverageRegions.DeleteObjects(System.String)
Deletes specified objects.
List: List of object numbers to delete. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.RFEM5.IAverageRegions.SetObjectID(System.Int32,System.UInt32,System.String)
Sets ID of the object.
No: Number or index of the object.
At: Specifies the type of access.
ID: New ID to be set.

Dlubal.RFEM5.IAverageRegions.GetAverageRegionCount
Gets count of average regions.
Returns: Count of average regions in the model.

Dlubal.RFEM5.IAverageRegions.GetAverageRegion(System.Int32,System.UInt32)
Gets interface for working with average region.
Returns: Average region interface.
No: No. or index of the average region you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IAverageRegions.SetAverageRegion(System.UInt32@)
Sets average region and returns it's interface.
Returns: Average region interface.
Region: Average region parameters.

Dlubal.RFEM5.IAverageRegions.GetAverageRegions
Gets array of average regions.
Returns: Array of average regions.

Dlubal.RFEM5.IAverageRegions.SetAverageRegions(System.UInt32@)
Sets array of average regions.
Regions: Array of average regions to be set.